In [1]:
# standard Python imports
from pathlib import Path

# scientific package imports
import numpy as np
from numpy.linalg import norm

import astropy.units as u
from astropy.table import QTable

import pandas as pd

# import my own class for this homework
from galaxies import Galaxies

In [2]:
g = Galaxies()

In [3]:
g.filenames

['MW_000', 'M31_000', 'M33_000']

In [4]:
g.get_masses()

<Table length=4>
Galaxy Name         Halo Mass          ...        f_bar
   str11              object           ...        object
----------- -------------------------- ... --------------------
         MW 1974924999999.9995 solMass ... 0.041265965348337104
        M31 1920880000000.0002 solMass ...   0.0675022801867386
        M33     186613000000.0 solMass ...  0.04747005048159133
Local Group    4082418000000.0 solMass ...  0.05407026079038631

In [5]:
masses = g.get_masses_df()
masses

,Galaxy Name,Halo Mass (Msun*1e12),Disk Mass (Msun*1e12),Bulge Mass (Msun*1e12),Total,f_bar
0,MW,1.975,0.075,0.010,2.060,0.041
1,M31,1.921,0.120,0.019,2.060,0.067
2,M33,0.187,0.009,0.000,0.196,0.046
3,Local Group,4.082,0.204,0.029,4.315,0.054

In [6]:
print(masses.to_latex(index=False, column_format='lccccc'))

\begin{tabular}{lccccc}
\toprule
 Galaxy Name &  Halo Mass (Msun*1e12) &  Disk Mass (Msun*1e12) &  Bulge Mass (Msun*1e12) &  Total &  f\_bar \\
\midrule
          MW &                  1.975 &                  0.075 &                   0.010 &  2.060 &  0.041 \\
         M31 &                  1.921 &                  0.120 &                   0.019 &  2.060 &  0.067 \\
         M33 &                  0.187 &                  0.009 &                   0.000 &  0.196 &  0.046 \\
 Local Group &                  4.082 &                  0.204 &                   0.029 &  4.315 &  0.054 \\
\bottomrule
\end{tabular}

In [7]:
g.get_counts_pivot()

typename  1 Halo  2 Disk  3 Bulge     All
name
M31        50000  120000    19000  189000
M33         5000    9300        0   14300
MW         50000   75000    10000  135000
All       105000  204300    29000  338300

In [39]:
pd.options.display.float_format = '{:,.3f}'.format
masses = g.get_masses_pivot()/1e12
masses

typename  1 Halo  2 Disk  3 Bulge   All
name
M31        1.921   0.120    0.019 2.060
M33        0.187   0.009    0.000 0.196
MW         1.975   0.075    0.010 2.060
All        4.082   0.204    0.029 4.316

In [12]:
print(masses.to_latex(index=True, column_format='lccccc'))

\begin{tabular}{lccccc}
\toprule
typename &  1 Halo &  2 Disk &  3 Bulge &   All \\
name &         &         &          &       \\
\midrule
M31  &   1.921 &   0.120 &    0.019 & 2.060 \\
M33  &   0.187 &   0.009 &    0.000 & 0.196 \\
MW   &   1.975 &   0.075 &    0.010 & 2.060 \\
All  &   4.082 &   0.204 &    0.029 & 4.316 \\
\bottomrule
\end{tabular}

In [34]:
df2 = pd.DataFrame()
df2['Galaxy Name'] = masses.index.values
df2['Halo Mass'] = masses['1 Halo'].values
df2['Disk Mass'] = masses['2 Disk'].values
df2['Bulge Mass'] = masses['3 Bulge'].values
df2['Total'] = masses['All'].values
df2['f_bar'] = (df2['Disk Mass'] + df2['Bulge Mass']) / df2['Total']

In [35]:
df2

  Galaxy Name  Halo Mass  Disk Mass  Bulge Mass  Total  f_bar
0         M31      1.921      0.120       0.019  2.060  0.068
1         M33      0.187      0.009       0.000  0.196  0.047
2          MW      1.975      0.075       0.010  2.060  0.041
3         All      4.082      0.204       0.029  4.316  0.054

In [37]:
print(df2.to_latex(index=False, column_format='lccccc'))

\begin{tabular}{lccccc}
\toprule
Galaxy Name &  Halo Mass &  Disk Mass &  Bulge Mass &  Total &  f\_bar \\
\midrule
        M31 &      1.921 &      0.120 &       0.019 &  2.060 &  0.068 \\
        M33 &      0.187 &      0.009 &       0.000 &  0.196 &  0.047 \\
         MW &      1.975 &      0.075 &       0.010 &  2.060 &  0.041 \\
        All &      4.082 &      0.204 &       0.029 &  4.316 &  0.054 \\
\bottomrule
\end{tabular}